cf/DataProcessors/_DemoTimeConsumingOperationMeasurement1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>_DemoTimeConsumingOperationMeasurement1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CounterpartiesCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyBankAccountCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteCreatedObjects</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/DataProcessors/_DemoTimeConsumingOperationMeasurement1/Forms/Form/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Object.DeleteCreatedObjects = True;
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure ExecuteAction(Command)
	BackgroundJob = StartExecutionAtServer();
	
	WaitSettings = TimeConsumingOperationsClient.IdleParameters(ThisObject);
	Handler = New NotifyDescription("AfterExecuteAction", ThisObject);
	TimeConsumingOperationsClient.WaitCompletion(BackgroundJob, Handler, WaitSettings);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Function StartExecutionAtServer()
	
	Common.MessageToUser(StringFunctionsClientServer.SubstituteParametersToString(NStr("ru = '%1 Начало выполнения...';
																										|en = '%1 Starting...';"), CurrentSessionDate()));
	
	ProcedureParameters = New Structure;
	ProcedureParameters.Insert("CounterpartiesCount", Object.CounterpartiesCount);
	ProcedureParameters.Insert("CounterpartyBankAccountCount", Object.CounterpartyBankAccountCount);
	ProcedureParameters.Insert("DeleteCreatedObjects", Object.DeleteCreatedObjects);
		
	ExecutionParameters = TimeConsumingOperations.BackgroundExecutionParameters(UUID);
	ExecutionParameters.BackgroundJobDescription = NStr("ru = 'Демо: замер длительной операции';
															|en = 'Demo: Measure long-running operation';");
	ExecutionParameters.RefinementErrors = NStr("ru = 'Не удалось выполнить действие по причине:';
												|en = 'Cannot perform the operation. Reason:';");
	
	Return TimeConsumingOperations.ExecuteInBackground("DataProcessors._DemoTimeConsumingOperationMeasurement1.ExecuteAction", 
		ProcedureParameters, ExecutionParameters);
	
EndFunction
	
// Parameters:
//  Result - See TimeConsumingOperationsClient.NewResultLongOperation
//  AdditionalParameters - Undefined
//
&AtClient
Procedure AfterExecuteAction(Result, AdditionalParameters) Export
	
	If Result = Undefined Then
		Return;
	EndIf;
	
	If Result.Status = "Error" Then
		StandardSubsystemsClient.OutputErrorInfo(
			Result.ErrorInfo);
		Return;
	EndIf;
	
	CommonClient.MessageToUser(NStr("ru = 'Действие выполнено.';
													|en = 'Operation completed.';"));	
	
EndProcedure
	
#EndRegion
